#-*- coding:UTF-8 -*-
#超声波模块引脚


#小车电机引脚定义
IN1 = 20
IN2 = 21
IN3 = 19
IN4 = 26
ENA = 16
ENB = 13

#小车按键定义
key = 8

#超声波引脚定义
EchoPin = 0
TrigPin = 1

#RGB三色灯引脚定义
LED_R = 22
LED_G = 27
LED_B = 24

#舵机引脚定义
ServoPin = 23

#红外避障引脚定义
AvoidSensorLeft = 12
AvoidSensorRight = 17


#--------------------------------------------------------------------------------


#颜色传感器模块


# 设置TCS3200端口(颜色传感器)
s2 = 10
s3 = 25
signal = 02

# 设置电机信号端口
Servo_180 = 11


#-------------------------------------------------------------------------------


#风机模块

motor_pin = 9

